##1. კონსოლიდან შეიტანეთ ორი რიცხვი და დაბეჭდეთ ყველა არითმეტიკული ოპერაცია (მიმატება, გამოკლება, გამრავლება, ჩვეულებრივი გაყოფა, მთელზე გაყოფა, ნაშთის აღება, ახარისხება).
number1 = int(input())
number2 = int(input())
print(number1+number2)
print(number1-number2)
print(number1*number2)
print(number1/number2)

##2. დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად. მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.
D1 = int(input())
D2 = int(input())
print(D1*D2/2)
##3. მომხმარებელის შეაქვს მეტრების რაოდენობა. დაბეჭდეთ შესაბამისი მნიშვნელობა სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.
Meter = float(input())
CM = Meter*100
DM = Meter*10
MM = Meter*10000
Mile = Meter*39.37
print(CM,DM,MM,Mile)
##4. დაწერეთ პროგრამა, რომელიც ითვლის სამკუთხედის ფართობს. მომხმარებელს კონსოლიდან შეყავს სამკუთხედის სიმაღლისა და ფუძის მნიშვნელობა.
height = int(input())
base = int(input())
print(height*base/2)
##5. კონსოლიდან შეიტანეთ ორნიშნა რიცხვი და დაბეჭდეთ ციფრთა ჯამი.
number = int(input())
print(int(number/10)+(number%10))
