# 1. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.
n = int(input("შეიყვანეთ რიცხვი n: "))
i = 1
total = 0
while i <= n:
    total += i
    i += 1
print(total)


# 2. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1
num = int(input("enter num: "))
while num > 0:
    print(num)
    num -= 1

range(5)
# 3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოი
# ცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.
number = 7
while True:
    guess = int(input("guess the number: "))
    if guess == number:
     print('სწორია')
    break
else:
    print('არასწორია')

# 4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, 
# შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ
#  შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.
total_sum = 0
while True: 
   number1 = input("input your number: ")
   if(number1) == 'sum':
    break
try:
   if int(number1) > 0:
      total_sum += number1
except ValueError:
        print("input your number")
print(total_sum)