# 1. შექმენით გლობალური ცვლადი int_list = [10,20,30,40] და დაწერეთ პითონის ფუნქცია,
#  რომელიც  მიიღებს რიცხვს პარამეტრად და გლობალურ int_list სიაში ჩაამატებს პარამეტრად მიღებულ რიცხვს.
int_list = [10,20,30,40]
def fun(n):
     global int_list
     int_list.append(n)
fun(5)
print(int_list)

    

# 2. დაწერეთ პითნის ფუნქცია რომელიც პარამეტრად იღებს რიცხვების სიას (ლისტს) და აბრუნებს რიცხვების ჯამს. 
# პარამეტრად უნდა მიიღოს შემდეგი სია [100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10].
list = [100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10]
def fun(n):
    total = 0
    for a in n:
        total += a
    return total
print(fun(list))

# 3. შექმენით გლობალური ცვლადი gl_str = "Global" და დაწერეთ პითონის ფუნქცია რომელიც ქმნის ლოკალურ ცვლადს 
# იგივე სახელით რაც გლობალურ ცვლადს აქვს  (gl_str) და აბრუნებს ლოკალური ცვლადის მნიშვნელობას.
gl_str = "Global"
def local():
    gl_str = "Local"
    return gl_str
print(local())
print(gl_str)
      

# 4. რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს ერთ პარამეტრს number და დააბრუნებს  
# ციფრების ჯამს (მაგალითად თუ ფუნქციამ მიიღო რიცხვი 12345, უნდა დააბრუნოს 15. რადგან 1+2+3+4+5 უდრის 15-ს).
def sumnumb(number):
    if number == 0:
     return 0
    return number % 10 + sumnumb(number//10)
print(sumnumb(12345))



# 5. რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად სტრიქონს და დააბრუნებს მის შებრუნებულ (revers) სტრიქონს
#  (მაგალითად  input: Hello   Output: olleH)
def reverse(string):
    if len(string) <= 1:
     return string
    return reverse(string[1:]) + string[0]
print(reverse("sofo"))